# -*- coding: utf-8  -*-
# @Author: ty
# @File name: address_list.py 
# @IDE: PyCharm
# @Create time: 1/7/21 4:45 PM
# @Description:
address_contain = {
    '省province': {
        '黑龙江': {
            'city': {}
        },
        '吉林': {
            'city': {}
        },
        '辽宁': {
            'city': {}
        },
        '河北': {
            'city': {}
        },
        '山西': {
            'city': {}

        },
        '青海': {
            'city': {}

        },
        '山东': {
            'city': {}

        },
        '河南': {
            'city': {}

        },
        '江苏': {
            'city': {}

        },
        '安徽': {
            'city': {}

        },
        '浙江': {
            'city': {}

        },
        '福建': {
            'city': {}

        },
        '江西': {
            'city': {}

        },
        '湖南': {
            'city': {}

        },
        '湖北': {
            'city': {}

        },
        '广东': {
            'city': {}

        },
        '台湾': {
            'city': {}

        },
        '海南': {
            'city': {}

        },
        '甘肃': {
            'city': {}

        },
        '陕西': {
            'city': {}

        },
        '四川': {
            'city': {}

        },
        '贵州': {
            'city': {}

        },
        '云南': {
            'city': {}

        },

    },
    '自治区': {
        '内蒙古': {
            'city': {}

        },
        '新疆': {
            'city': {}

        },
        '西藏': {
            'city': {}

        },
        '宁夏': {
            'city': {}

        },
        '广西': {
            'city': {}

        },
    },
    '直辖市': {
        '北京': {},
        '天津': {},
        '上海': {},
        '重庆': {},
    },
    '特别行政区': {
        '香港': {},
        '澳门': {},
    },
}